"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
const formatString_1 = require("../format/formatString");
const getHash_1 = require("../getHash/getHash");
const allLettersOfTheWorld = "ABCDEFGHIJKLMNOPQRSTUVWXYZàäèéëïĳöüáêéèëïíîôóúûêôúûÆØÅæøåÄÖäöÅÄÖåäöÄÖÕÜäöõüÄÖÜẞäöüßÇÊÎŞÛçêîşûĂÂÎȘȚăâîșțÂÊÎÔÛŴŶÁÉÍÏâêîôûŵŷáéíïÓÚẂÝÀÈÌÒÙẀỲÄËÖÜẄŸóúẃýàèìòùẁỳäëöüẅÿĈĜĤĴŜŬĉĝĥĵŝŭÇĞİÖŞÜçğıöşüÁÐÉÍÓÚÝÞÆÖáðéíóúýþæöÁÐÍÓÚÝÆØáðíóúýæøÁÉÍÓÖŐÚÜŰáéíóöőúüűÀÇÉÈÍÓÒÚÜÏàçéèíóòúüïÀÂÆÇÉÈÊËÎÏÔŒÙÛÜŸàâæçéèêëîïôœùûüÿÁÀÇÉÈÍÓÒÚËÜÏáàçéèíóòúëüïÁÉÍÓÚÂÊÔÀãõçáéíóúâêôàÁÉÍÑÓÚÜáéíñóúüÀÉÈÌÒÙàéèìòùÁÉÍÓÚÝÃẼĨÕŨỸÑG̃áéíóúýãẽĩõũỹñg̃ÁĄĄ́ÉĘĘ́ÍĮĮ́ŁŃáąą́éęę́íįį́łńÓǪǪ́āą̄ēę̄īį̄óōǫǫ́ǭúūÓǪǪ́óǫǫ́ÚŲŲ́úųų́ąłńóżćęłńóśźżćśůźãéëòôùČŠŽĆĐÁĎÉĚÍŇÓŘŤÚŮÝáďéěíňóřťúůýÁÄĎÉÍĽĹŇÓÔŔŤÚÝáäďéíľĺňóôŕťúýĀĒĢĪĶĻŅŌŖŪāēģīķļņōŗūĄĘĖĮŲŪąęėįųūĐÀẢÃÁẠĂẰẲẴẮẶÂẦẨẪẤẬÈẺẼÉẸÊỀỂỄẾỆÌỈĨÍỊÒỎÕÓỌÔỒỔỖỐỘƠỜỞỠỚỢÙỦŨÚỤƯỪỬỮỨỰỲỶỸÝỴđàảãáạăằẳẵắặâầẩẫấậèẻẽéẹêềểễếệìỉĩíịòỏõóọồổỗốơờởỡớợùủũúụưừửữứựỳỷỹýỵꞗĕŏŭo᷄ơ᷄u᷄āēīōūéñ  ح خ د ذ ر ز س ش ص ض ط ظ ع غ ف ق ك ل م ن ه و يپ چ ژ گঅ আ কা কি কী উ কু ঊ কূ ঋ কৃ এ কে ঐ কৈ ও কো ঔ কৌ ক্ কত্‍ কং কঃ কঁ ক খ গ ঘ ঙ চ ছ জ ঝ ঞ ট ঠ ড ঢ ণ ত থ দ ধ ন প ফ ব ভ ম য র ৰ ল ৱ শ ষ স হ য় ড় ঢ় ০ ১ ২৩ ৪ ৫ ৬ ৭ ৮ ৯अ आ इ ई उ ऊ ऋ ॠ ऌ ॡ ऍ ऎ ए ऐ ऑ ऒ ओ ओ क ख ग घ ङ च छ ज झ ञ ट ठ ड ढ ण त थ द ध न प फ ब भ म य र ल ळ व श ष स ह ० १ २ ३ ४ ५ ६ ७ ८ ९ प् पँ पं पः प़ पऽਅਆਇਈਉਊਏਐਓਔਕਖਗਘਙਚਛਜਝਞਟਠਡਢਣਤਥਦਧਨਪਫਬਭਮਯਰਲਲ਼ਵਸ਼ਸਹઅ આ ઇ ઈ ઉ ઊ ઋ ઌ ઍ એ ઐ ઑ ઓ ઔ ક ખ ગ ઘ ઙ ચ છ જ ઝ ઞ ટ ઠ ડ ઢ ણ ત થ દ ધ ન પ ફ બ ભ મ ય ર લ ળ વ શ ષ સ હ ૠ ૡૢૣཀ ཁ ག ང ཅ ཆ ཇ ཉ ཏ ཐ ད ན པ ཕ བ མ ཙ ཚ ཛ ཝ ཞ ཟ འ ཡ ར ལ ཤ ས ཧ ཨ АБВГДЕЖЗИКЛМНОПРСТУФХЦЧШЙЩЬЮЯЪЁЫЭЎЩҐЄІЇЉЊЏЃЌЅЋЂЄꙂꙀЗІЇꙈОуꙊѠЩЪꙐЬѢЮꙖѤѦѨѪѬѮѰѲѴҀӁΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩαβγδεζηθικλμνξοπρσςτυφχψωאבגדהוזחטיכלמנסעפצקרשת漢字文化圈 あいうえおのアイウエオノ위키백과에ㄅㄆㄇㄈㄉㄊㄋㄌㄍㄎㄏㄓㄨˋㄧㄣㄈㄨˊㄏㄠˋㄪㄫㄬកខគឃងចឆជឈញដឋឌឍណតថទធនបផពភមសហយរលឡអវអ្កអ្ខអ្គអ្ឃអ្ងអ្ចអ្ឆអ្ឈអ្ញអ្ឌអ្ឋអ្ឌអ្ឃអ្ណអ្តអ្ថអ្ទអ្ធអ្នអ្បអ្ផអ្ពអ្ភអ្មអ្សអ្ហអ្យអ្រអ្យអ្លអ្អអ្វអក្សរខ្មែរ Ա Բ Գ Դ Ե Զ Է Ը Թ Ժ Ի Լ Խ Ծ Կ Հ Ձ Ղ Ճ Մ Յ Ն Շ Ո Չ Պ Ջ Ռ Ս Վ Տ Ր Ց Ւ Փ Ք Օ Ֆა ბ გდ ევ ზ ჱ თ ი კ ლ მ ნ ჲ ო პ ჟ რ ს ტ ჳ უ ფ ქ ღ ყ შ ჩ ც ძ წ ჭ ხ ჴ ჯ ჰ ჵ ჶ ჷ ჸกขฃคฅฆงจฉชซฌญฎฏฐฑฒณดตถทธนบปผฝพฟภมยรฤลฦวศษสหฬอฮฯะา฿เแโใไๅๆ๏๐๑๒๓๔๕๖๗๘๙๚๛ⴰⴱⴲⴳⴴⴵⴶⴷⴸⴹⴺⴻⴼⴽⴾⴿⵀⵁⵂⵃⵄⵅⵆⵇⵈⵉⵊⵋⵌⵍⵎⵐⵑⵒⵓⵔⵕⵖⵗⵘⵙⵚⵛⵜⵝⵞⵠⵡⵢⵣⵤⵥⵦ";
const setOfAllLettersOfTheWorld = new Set(allLettersOfTheWorld);
const hashTest = (toHash) => {
    const hash = (0, getHash_1.getHash)(toHash);
    return typeof hash === "string" && hash.length === 32;
};
const formatTest = (char) => {
    if (char.length !== 1) {
        console.log("ERROR:", char);
        return false;
    }
    const formatted = (0, formatString_1.format)(char);
    return formatted === char.toLowerCase();
};
const singularHashTest = (str) => {
    const hash = (0, getHash_1.getHash)(str);
    return typeof hash === "string" && hash.length === 32;
};
// for loop of set
for (const char of setOfAllLettersOfTheWorld) {
    if (!formatTest(char)) {
        console.log("ERROR", char, "formatted:", (0, formatString_1.format)(char));
    }
}
const buggyString = "👨‍👩‍👧‍👦";
const buggyStringHash = (0, getHash_1.getHash)(buggyString);
console.log("buggyStringHash", buggyStringHash);
const fmt = (0, formatString_1.format)(buggyString);
console.log("fmt", fmt);
const stringWithSpaces = "a CdğD* efğEFie üf,i.";
const fmt_two = (0, formatString_1.format)(stringWithSpaces);
console.log("fmt_two", fmt_two);
const elonmuskchild = "X Æ A-Xii ";
const fmt_three = (0, formatString_1.format)(elonmuskchild);
console.log("fmt_three", fmt_three);
// first format than hash
// with half arabic half japanese half swedish half english letters
const halfArabicHalfJapaneseHalfSwedishHalfEnglishLetters = "مرحبا بالعالم こんにちは世界 你好，世界 สวัสดีชาวโลก abcdef";
const fmt_four = (0, formatString_1.format)(halfArabicHalfJapaneseHalfSwedishHalfEnglishLetters);
console.log("fmt_four", fmt_four);
const hash_four = (0, getHash_1.getHash)(fmt_four);
console.log("hash_four", hash_four);
